# დავალება 1:
# ● მოცემული გაქვთ ოთხი რიცხვისგან შემდგარი მასივი, სადაც არ გვხვდება
# დუპლიკატი (ერთი და იგივე რიცხვი ორჯერ არ განმეორდება მასივში).
# ჩამოწერეთ ყველა შესაძლო უტოლობა (ჯამში 16), სადაც გამოჩნდება მასივის
# ელემენტებს შორის კავშირი, მაგალითად a1 < a3 < a2 < a4

a = [1,2,3,4]

# a1 > a2 / a1 > a3 / a1 > a4
# a1 > a2 / a1 > a3 / a1 < a4
# a1 > a2 / a1 < a3 / a3 > a4
# a1 > a2 / a1 < a3 / a3 < a4

# a1 < a2 / a2 > a3 / a2 > a4
# a1 < a2 / a2 > a3 / a2 < a4
# a1 < a2 / a2 < a3 / a3 > a4
# a1 < a2 / a2 < a3 / a3 < a4

#--------------------------- იგივე წერია... (8ზე მეტი ვერ დავითვალე)

#a1 > a2 > a3 > a4
#a1 > a2 > a3 < a4
#a1 > a2 < a3 > a4
#a1 > a2 < a3 < a4
#a1 < a2 > a3 > a4
#a1 < a2 > a3 < a4
#a1 < a2 < a3 > a4
#a1 < a2 < a3 < a4
